{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 384,
  "id2label": {
    "0": "symphony",
    "1": "opera",
    "2": "solo",
    "3": "chamber",
    "4": "pop vocal ballad",
    "5": "adult contemporary",
    "6": "teen pop",
    "7": "contemporary dance pop",
    "8": "dance pop",
    "9": "classic indie pop",
    "10": "chamber cabaret and art pop",
    "11": "soul or RnB",
    "12": "adult alternative rock",
    "13": "uplifting anthemic rock",
    "14": "soft rock",
    "15": "acoustic pop"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "acoustic pop": 15,
    "adult alternative rock": 12,
    "adult contemporary": 5,
    "chamber": 3,
    "chamber cabaret and art pop": 10,
    "classic indie pop": 9,
    "contemporary dance pop": 7,
    "dance pop": 8,
    "opera": 1,
    "pop vocal ballad": 4,
    "soft rock": 14,
    "solo": 2,
    "soul or RnB": 11,
    "symphony": 0,
    "teen pop": 6,
    "uplifting anthemic rock": 13
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 6,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 384,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.0.dev0"
}
